#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/my_terraform_rg]
azurerm_app_service_plan.app_plan: Refreshing state... [id=/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/my_terraform_rg/providers/Microsoft.Web/serverfarms/my-appserviceplan]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_app_service_plan.app_plan has changed
  ~ resource "azurerm_app_service_plan" "app_plan" {
        id                           = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/my_terraform_rg/providers/Microsoft.Web/serverfarms/my-appserviceplan"
        name                         = "my-appserviceplan"
      + tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_app_service.webapp will be created
  + resource "azurerm_app_service" "webapp" {
      + app_service_plan_id               = (known after apply)
      + app_settings                      = {
          + "SOME_KEY" = "some-value"
        }
      + client_affinity_enabled           = false
      + client_cert_enabled               = false
      + client_cert_mode                  = (known after apply)
      + custom_domain_verification_id     = (known after apply)
      + default_site_hostname             = (known after apply)
      + enabled                           = true
      + https_only                        = false
      + id                                = (known after apply)
      + key_vault_reference_identity_id   = (known after apply)
      + location                          = "westeurope"
      + name                              = "terraform-web-019"
      + outbound_ip_address_list          = (known after apply)
      + outbound_ip_addresses             = (known after apply)
      + possible_outbound_ip_address_list = (known after apply)
      + possible_outbound_ip_addresses    = (known after apply)
      + resource_group_name               = "rg-terraform-web-sql-db"
      + site_credential                   = (known after apply)

      + auth_settings {
          + additional_login_params        = (known after apply)
          + allowed_external_redirect_urls = (known after apply)
          + default_provider               = (known after apply)
          + enabled                        = (known after apply)
          + issuer                         = (known after apply)
          + runtime_version                = (known after apply)
          + token_refresh_extension_hours  = (known after apply)
          + token_store_enabled            = (known after apply)
          + unauthenticated_client_action  = (known after apply)

          + active_directory {
              + allowed_audiences = (known after apply)
              + client_id         = (known after apply)
              + client_secret     = (sensitive value)
            }

          + facebook {
              + app_id       = (known after apply)
              + app_secret   = (sensitive value)
              + oauth_scopes = (known after apply)
            }

          + google {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + microsoft {
              + client_id     = (known after apply)
              + client_secret = (sensitive value)
              + oauth_scopes  = (known after apply)
            }

          + twitter {
              + consumer_key    = (known after apply)
              + consumer_secret = (sensitive value)
            }
        }

      + connection_string {
          + name  = "Database"
          + type  = "SQLAzure"
          + value = (sensitive value)
        }

      + logs {
          + detailed_error_messages_enabled = (known after apply)
          + failed_request_tracing_enabled  = (known after apply)

          + application_logs {
              + file_system_level = (known after apply)

              + azure_blob_storage {
                  + level             = (known after apply)
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }
            }

          + http_logs {
              + azure_blob_storage {
                  + retention_in_days = (known after apply)
                  + sas_url           = (sensitive value)
                }

              + file_system {
                  + retention_in_days = (known after apply)
                  + retention_in_mb   = (known after apply)
                }
            }
        }

      + site_config {
          + acr_use_managed_identity_credentials = false
          + always_on                            = false
          + dotnet_framework_version             = "v4.0"
          + ftps_state                           = (known after apply)
          + http2_enabled                        = false
          + ip_restriction                       = (known after apply)
          + linux_fx_version                     = (known after apply)
          + local_mysql_enabled                  = (known after apply)
          + managed_pipeline_mode                = (known after apply)
          + min_tls_version                      = (known after apply)
          + number_of_workers                    = (known after apply)
          + remote_debugging_enabled             = false
          + remote_debugging_version             = (known after apply)
          + scm_ip_restriction                   = (known after apply)
          + scm_type                             = "LocalGit"
          + scm_use_main_ip_restriction          = false
          + vnet_route_all_enabled               = (known after apply)
          + websockets_enabled                   = (known after apply)
          + windows_fx_version                   = (known after apply)

          + cors {
              + allowed_origins     = (known after apply)
              + support_credentials = (known after apply)
            }
        }

      + source_control {
          + branch             = (known after apply)
          + manual_integration = (known after apply)
          + repo_url           = (known after apply)
          + rollback_enabled   = (known after apply)
          + use_mercurial      = (known after apply)
        }

      + storage_account {
          + access_key   = (sensitive value)
          + account_name = (known after apply)
          + mount_path   = (known after apply)
          + name         = (known after apply)
          + share_name   = (known after apply)
          + type         = (known after apply)
        }
    }

  # azurerm_app_service_plan.app_plan must be replaced
-/+ resource "azurerm_app_service_plan" "app_plan" {
      ~ id                           = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/my_terraform_rg/providers/Microsoft.Web/serverfarms/my-appserviceplan" -> (known after apply)
      - is_xenon                     = false -> null
      ~ maximum_elastic_worker_count = 1 -> (known after apply)
      ~ maximum_number_of_workers    = 10 -> (known after apply)
      ~ name                         = "my-appserviceplan" -> "appserviceplan-web" # forces replacement
      - per_site_scaling             = false -> null
      - reserved                     = false -> null
      ~ resource_group_name          = "my_terraform_rg" -> "rg-terraform-web-sql-db" # forces replacement
      - tags                         = {} -> null
      - zone_redundant               = false -> null
        # (2 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 1 -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_resource_group.rg must be replaced
-/+ resource "azurerm_resource_group" "rg" {
      ~ id       = "/subscriptions/17b12858-3960-4e6f-a663-a06fdae23428/resourceGroups/my_terraform_rg" -> (known after apply)
      ~ name     = "my_terraform_rg" -> "rg-terraform-web-sql-db" # forces replacement
        tags     = {
            "environment" = "production"
        }
        # (1 unchanged attribute hidden)
    }

  # azurerm_sql_database.db will be created
  + resource "azurerm_sql_database" "db" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + id                               = (known after apply)
      + location                         = "westeurope"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "terraform-sqldatabase20"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = (known after apply)
      + resource_group_name              = "rg-terraform-web-sql-db"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "terraform-sqlserver-019"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

  # azurerm_sql_server.sqldb will be created
  + resource "azurerm_sql_server" "sqldb" {
      + administrator_login          = "user01"
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westeurope"
      + name                         = "terraform-sqlserver-019"
      + resource_group_name          = "rg-terraform-web-sql-db"
      + version                      = "12.0"

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + webapp_ips = (known after apply)
  + webapp_url = (known after apply)

Warning: Deprecated Resource

  with azurerm_app_service_plan.app_plan,
  on main.tf line 10, in resource "azurerm_app_service_plan" "app_plan":
  10: resource "azurerm_app_service_plan" "app_plan" {

The `azurerm_app_service_plan` resource has been superseded by the
`azurerm_service_plan` resource. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 7 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @HoussemDellai, Action: `pull_request`, Working Directory: ``, Workflow: `Create Infra with Terraform`*